pacientes/app/Models/ModeloPaciente.php

UPDATE `tbl_pacientes` SET `pac_nombre` = 'Santiago Castillo', `pac_dni` = '1002003003', `pac_altura` = '135', `pac_peso` = '12', `pac_imc` = '6.58', `pac_resultado` = 'Bajo peso'
WHERE `pac_id` = '3'
---
        public function actualizar($data, $id){
            $valor=$this->db->table('tbl_pacientes');
            $valor->set($data);
            $valor->where('pac_id', $id);

            return $valor->update();